{
  "rule_id": "mumbai_dcpr_table_140_row_1",
  "title": "Table 140 - Row 1",
  "jurisdiction": "mumbai_dcpr",
  "version": "extracted_from_docx",
  "clause_number": "Table-140.1",
  "clause_text": "Provision and Location: Dimensions | At least one continuous unobstructed accessible route or accessible path of travel shall be provided which connects all accessible elements and spaces in a building or facility for Differently Abled individuals. An accessible route shall be provided from public transportation stops, accessible parking, passenger loading zones and public streets or sidewalks to the accessible building entrances and lifts served. Directional signs bearing the symbol shall be displayed at all other non-accessible entrances to direct to the accessible entrance. The access path should have an even surface without any slope.: Access path from plot entry and surface parking to building entrance shall be of minimum 1.5 m width and for a two-way traffic, it should be 1.8 m wide.",
  "parsed": {
    "type": "table",
    "table_data": {
      "headers": [
        "Provision and Location",
        "At least one continuous unobstructed accessible route or accessible path of travel shall be provided which connects all accessible elements and spaces in a building or facility for Differently Abled individuals. An accessible route shall be provided from public transportation stops, accessible parking, passenger loading zones and public streets or sidewalks to the accessible building entrances and lifts served. Directional signs bearing the symbol shall be displayed at all other non-accessible entrances to direct to the accessible entrance. The access path should have an even surface without any slope."
      ],
      "values": [
        "Dimensions",
        "Access path from plot entry and surface parking to building entrance shall be of minimum 1.5 m width and for a two-way traffic, it should be 1.8 m wide."
      ]
    }
  },
  "examples": [],
  "ambiguous": false,
  "ambiguity_reason": null,
  "source_pdf": {
    "filename": "MUBAI-DCPR.docx",
    "page": "table_140",
    "text_snippet": "Provision and Location: Dimensions | At least one continuous unobstructed accessible route or accessible path of travel shall be provided which connects all accessible elements and spaces in a buildin"
  },
  "created_at": "2025-11-19T00:14:48.928841",
  "extraction_method": "docx_table",
  "approved_at": "2025-11-19T00:15:26.825426",
  "approved_by": "auto_approve_script",
  "verification_status": "auto_approved"
}