{
  "rule_id": "mumbai_dcpr_rule_276",
  "title": "Completion certificate: The owner, through his licensed plumber, shall furnish a drainage completion certificate to the Commissioner in the form given at Annexure 17",
  "jurisdiction": "mumbai_dcpr",
  "version": "extracted_from_docx",
  "clause_number": "Section 276",
  "clause_text": "Completion certificate: The owner, through his licensed plumber, shall furnish a drainage completion certificate to the Commissioner in the form given at Annexure 17. The owner through his licensed surveyor/engineer/structural engineer/supervisor or his architect, or any professional on record, who has supervised the construction, shall furnish a building completion certificate to the Commissioner in the form given at Annexure 18. These certificates shall be accompanied by three sets of plans of the completed development. The Commissioner shall inspect the work and, after satisfying himself that there is no deviation from the approved plans, issue a certificate of acceptance of the completion of the work in the form given at Annexure 19. Further on receipt of development completion certificate for entire development in the form of Annexure 16, and after satisfying himself that there is no deviation from the sanctioned plans, may issue Building Completion certificate in the form given at Annexure 22 or refuse the Building Completion Certificate within 21 days from the date of receipt of the request for the said Building completion certificate. Deviation in outer dimension to the extent of 25 mm shall be tolerated subject to condition that carpet area shall remain unchanged.",
  "chapter": null,
  "section": "Documents at site:",
  "parsed": {
    "type": "rule",
    "rule_logic": null
  },
  "examples": [],
  "ambiguous": false,
  "ambiguity_reason": null,
  "source_pdf": {
    "filename": "MUBAI-DCPR.docx",
    "page": "extracted_from_docx",
    "text_snippet": "Completion certificate: The owner, through his licensed plumber, shall furnish a drainage completion certificate to the Commissioner in the form given at Annexure 17. The owner through his licensed su"
  },
  "created_at": "2025-11-19T00:14:36.183875",
  "extraction_method": "docx_direct",
  "approved_at": "2025-11-19T00:15:20.232219",
  "approved_by": "auto_approve_script",
  "verification_status": "auto_approved"
}