{
  "rule_id": "mumbai_dcpr_table_144_row_1",
  "title": "Table 144 - Row 1",
  "jurisdiction": "mumbai_dcpr",
  "version": "extracted_from_docx",
  "clause_number": "Table-144.1",
  "clause_text": "Provision & Location: Dimensions | Publicly accessible buildings should preferably have automatic/self-closing doors, instead of manual doors. Manual doors should be easy and light in operation. Revolving doors should be avoided, but, in cases where a revolving door is the single means of entry, adequate space to accommodate wheelchair users should be provided.: The minimum clear opening of doorways shall be 0.9 m measured between the face of the door and the face of the doorstop with the door open at 90° as illustrated in Sketch No 1 in Annexure 23 Thresholds of doorways should not exceed12 mm. Raised threshold and floor level changes at doorways should be leveled off with a slope on each side of threshold. Manual doors should incorporate kick plates 0.3 m-0.4 m high to withstand impact of wheelchair footrest (this is especially",
  "parsed": {
    "type": "table",
    "table_data": {
      "headers": [
        "Provision & Location",
        "Publicly accessible buildings should preferably have automatic/self-closing doors, instead of manual doors. Manual doors should be easy and light in operation. Revolving doors should be avoided, but, in cases where a revolving door is the single means of entry, adequate space to accommodate wheelchair users should be provided."
      ],
      "values": [
        "Dimensions",
        "The minimum clear opening of doorways shall be 0.9 m measured between the face of the door and the face of the doorstop with the door open at 90° as illustrated in Sketch No 1 in Annexure 23 Thresholds of doorways should not exceed12 mm. Raised threshold and floor level changes at doorways should be leveled off with a slope on each side of threshold. Manual doors should incorporate kick plates 0.3 m-0.4 m high to withstand impact of wheelchair footrest (this is especially"
      ]
    }
  },
  "examples": [],
  "ambiguous": false,
  "ambiguity_reason": null,
  "source_pdf": {
    "filename": "MUBAI-DCPR.docx",
    "page": "table_144",
    "text_snippet": "Provision & Location: Dimensions | Publicly accessible buildings should preferably have automatic/self-closing doors, instead of manual doors. Manual doors should be easy and light in operation. Revol"
  },
  "created_at": "2025-11-19T00:14:48.969237",
  "extraction_method": "docx_table",
  "approved_at": "2025-11-19T00:15:26.832293",
  "approved_by": "auto_approve_script",
  "verification_status": "auto_approved"
}